{
  "month": "May",
  "days": [
    {
      "day": 121,
      "date": "May 1",
      "title": "Digital Art - Creating in the Computer Age",
      "learning_objective": "Practice digital creativity while understanding how technology expands artistic possibilities and enables new forms of cultural expression."
    },
    {
      "day": 122,
      "date": "May 2",
      "title": "Friction - The Hidden Force That Shapes Your World",
      "learning_objective": "Model mechanical forces while understanding how physics principles enable technological innovation and engineering solutions."
    },
    {
      "day": 123,
      "date": "May 3",
      "title": "Financial Technology - Money in the Digital World",
      "learning_objective": "Understand digital payment systems while exploring economic equity, financial inclusion, and the regulation of technological innovation."
    },
    {
      "day": 124,
      "date": "May 4",
      "title": "Topology - The Mathematics of Shape Without Size",
      "learning_objective": "Explore mathematical concepts while understanding how abstract mathematics enables computer science, network analysis, and technological innovation."
    },
    {
      "day": 125,
      "date": "May 5",
      "title": "Social Work - Helping People and Communities",
      "learning_objective": "Understand social support systems while building empathy and advocacy skills essential for community organizing and social justice work."
    },
    {
      "day": 126,
      "date": "May 6",
      "title": "Future Forecasting - Predicting Tomorrow's Needs",
      "learning_objective": "Practice strategic thinking and scenario planning while understanding how technological and social trends affect policy and planning decisions."
    },
    {
      "day": 127,
      "date": "May 7",
      "title": "Desert Ecosystems - Life in Extreme Dryness",
      "learning_objective": "Explore adaptation strategies while understanding how ecological knowledge informs sustainable technology and climate adaptation."
    },
    {
      "day": 128,
      "date": "May 8",
      "title": "Graphic Design - Visual Communication",
      "learning_objective": "Practice visual literacy while understanding how design affects information accessibility, democratic participation, and social justice."
    },
    {
      "day": 129,
      "date": "May 9",
      "title": "Balance and Stability - The Physics of Staying Upright",
      "learning_objective": "Model physical systems while understanding how stability principles apply to engineering, economics, and social systems."
    },
    {
      "day": 130,
      "date": "May 10",
      "title": "Construction Technology - Building Better Structures",
      "learning_objective": "Explore engineering principles while understanding how construction technology affects housing equity, sustainability, and community development."
    },
    {
      "day": 131,
      "date": "May 11",
      "title": "Combinatorics - The Mathematics of Counting",
      "learning_objective": "Master counting principles while understanding how combinatorial thinking enables computer science, cryptography, and technological optimization."
    },
    {
      "day": 132,
      "date": "May 12",
      "title": "International Relations - How Nations Interact",
      "learning_objective": "Understand diplomatic processes while building skills for international cooperation, conflict resolution, and global citizenship."
    },
    {
      "day": 133,
      "date": "May 13",
      "title": "Decision Making - Choosing Wisely",
      "learning_objective": "Practice rational decision-making while understanding how cognitive biases affect personal choices and democratic deliberation."
    },
    {
      "day": 134,
      "date": "May 14",
      "title": "Wetland Ecosystems - Nature's Water Filters",
      "learning_objective": "Explore ecosystem services while understanding how ecological knowledge informs environmental policy and sustainable technology."
    },
    {
      "day": 135,
      "date": "May 15",
      "title": "Fashion Design - Wearable Art",
      "learning_objective": "Practice creative design while understanding how fashion reflects social values and affects environmental sustainability and labor rights."
    },
    {
      "day": 136,
      "date": "May 16",
      "title": "Light and Shadows - How Light Travels and Creates the World We See",
      "learning_objective": "Understand optical principles while exploring how light manipulation enables photography, communication, and renewable energy technology."
    },
    {
      "day": 137,
      "date": "May 17",
      "title": "Drone Technology - Flying Robots",
      "learning_objective": "Explore unmanned systems while understanding ethical implications for privacy, warfare, and civilian applications of autonomous technology."
    },
    {
      "day": 138,
      "date": "May 18",
      "title": "Media Studies - Understanding Information and Entertainment",
      "learning_objective": "Build media literacy while understanding how information systems affect democratic participation, social movements, and cultural expression."
    },
    {
      "day": 139,
      "date": "May 19",
      "title": "Cultural Studies - How Culture Shapes Experience",
      "learning_objective": "Understand cultural analysis while building intercultural competency essential for global citizenship and cross-cultural collaboration."
    },
    {
      "day": 140,
      "date": "May 20",
      "title": "River Systems - Pathways of Fresh Water",
      "learning_objective": "Model hydrological systems while understanding how water resources affect international relations, economic development, and environmental sustainability."
    },
    {
      "day": 141,
      "date": "May 21",
      "title": "Pollination - Nature's Reproduction Strategy",
      "learning_objective": "Explore ecological relationships while understanding how biological knowledge informs agriculture, conservation, and biotechnology applications."
    },
    {
      "day": 142,
      "date": "May 22",
      "title": "Interior Design - Creating Beautiful Spaces",
      "learning_objective": "Practice spatial design while understanding how built environments affect wellbeing, accessibility, and social interaction."
    },
    {
      "day": 143,
      "date": "May 23",
      "title": "Waves and Vibrations - How Energy Travels Through Matter",
      "learning_objective": "Model wave phenomena while understanding how wave physics enables communication technology, medical imaging, and renewable energy."
    },
    {
      "day": 144,
      "date": "May 24",
      "title": "Sensor Technology - Machines That Detect",
      "learning_objective": "Understand detection systems while exploring how sensor networks enable smart cities, environmental monitoring, and personal health tracking."
    },
    {
      "day": 145,
      "date": "May 25",
      "title": "Prototyping - Testing Ideas in the Real World",
      "learning_objective": "Practice iterative design while understanding how rapid prototyping enables innovation, democratic participation, and evidence-based decision-making."
    },
    {
      "day": 146,
      "date": "May 26",
      "title": "Development Studies - How Societies Progress",
      "learning_objective": "Understand development theory while building analytical skills for evaluating social programs, international aid, and sustainable development."
    },
    {
      "day": 147,
      "date": "May 27",
      "title": "Metamorphosis - Amazing Life Transformations",
      "learning_objective": "Explore biological development while understanding how transformation processes inspire personal growth, social change, and technological innovation."
    },
    {
      "day": 148,
      "date": "May 28",
      "title": "Hibernation - Nature's Energy Conservation",
      "learning_objective": "Understand adaptation strategies while exploring how biological efficiency inspires sustainable technology and resource management."
    },
    {
      "day": 149,
      "date": "May 29",
      "title": "Architecture - Designing Buildings That Inspire",
      "learning_objective": "Practice design thinking while understanding how architecture reflects social values and affects community wellbeing and environmental sustainability."
    },
    {
      "day": 150,
      "date": "May 30",
      "title": "Atomic Structure - The Building Blocks of Everything",
      "learning_objective": "Understand atomic theory while building scientific literacy essential for evaluating nuclear energy, medical technology, and materials science."
    },
    {
      "day": 151,
      "date": "May 31",
      "title": "Wind Technology - Harnessing Air Movement",
      "learning_objective": "Explore renewable energy while understanding how sustainable technology enables energy independence and climate change mitigation."
    }
  ]
}